Q1. List any five functions of the pandas library with execution.



read_csv(): This function is used to read data from a CSV file into a pandas DataFrame.
Execution:

In [103]:
import pandas as pd


df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [104]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [105]:
pip install panda

Requirement already satisfied: panda in /opt/conda/lib/python3.10/site-packages (0.3.1)
Requirement already satisfied: setuptools in /opt/conda/lib/python3.10/site-packages (from panda) (65.5.1)
Requirement already satisfied: requests in /opt/conda/lib/python3.10/site-packages (from panda) (2.28.1)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /opt/conda/lib/python3.10/site-packages (from requests->panda) (1.26.13)
Requirement already satisfied: idna<4,>=2.5 in /opt/conda/lib/python3.10/site-packages (from requests->panda) (3.4)
Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.10/site-packages (from requests->panda) (2022.12.7)
Requirement already satisfied: charset-normalizer<3,>=2 in /opt/conda/lib/python3.10/site-packages (from requests->panda) (2.1.1)
Note: you may need to restart the kernel to use updated packages.

describe(): This function is used to generate descriptive statistics for a DataFrame.

In [106]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

groupby(): This function is used to group a DataFrame by one or more columns and apply a function to each group.

In [107]:
df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

dropna(): This function is used to remove rows or columns with missing values from a DataFrame.

In [108]:
import pandas as pd
import numpy as np


df3 = pd.DataFrame({'A': [1, np.nan, 3], 'B': [4, np.nan, np.nan], 'C': [7, 8, 9]})


df3.dropna()

     A    B  C
0  1.0  4.0  7

pivot_table(): This function is used to create a spreadsheet-style pivot table as a DataFrame.

In [133]:

data = pd.DataFrame({'A': ['foo', 'foo', 'bar', 'bar', 'foo', 'foo', 'bar', 'bar'],
                     'B': ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'],
                     'C': [1, 2, 3, 4, 5, 6, 7, 8],
                     'D': [9, 10, 11, 12, 13, 14, 15, 16]})


df4 = pd.pivot_table(data, values='C', index=['A'], columns=['B'])

In [110]:
df4

B    one  two
A
bar    5    6
foo    3    4

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [111]:
df = pd.DataFrame({'values':[10,20,30,40,50,]})

In [112]:
df[0:3].sum()

values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [113]:
def add(df):
    words = df['Text'].str.split()

    df['Word_Count'] = words.apply(len)

    return df

In [114]:
data = {'Text': ['This is a sentence', 'This is another sentence', 'another sentence']}
df = pd.DataFrame(data)

In [115]:
add(df)

                       Text  Word_Count
0        This is a sentence           4
1  This is another sentence           4
2          another sentence           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size and DataFrame.shape are both methods of a Pandas DataFrame object in Python, but they have different functionalities.

DataFrame.size() returns the total number of elements in the DataFrame. It is equivalent to the product of the number of rows and the number of columns in the DataFrame. This method returns a single value, which is an integer.

DataFrame.shape returns a tuple that contains the number of rows and the number of columns in the DataFrame. This method is useful when you need to know the dimensions of the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [116]:
data = {'Email': ['suhail@example.com', 'saqib@example.com', 'rashid7@example.com']}
df = pd.DataFrame(data)

def extract(email):
    return email.split('@')[0]

df['Username'] = df['Email'].apply(lambda email : extract(email))

In [117]:
df

                 Email Username
0   suhail@example.com   suhail
1    saqib@example.com    saqib
2  rashid7@example.com  rashid7

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [118]:
import pandas as pd

def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

In [119]:
df = pd.DataFrame({'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]})
select_rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [120]:
df = pd.DataFrame({'Values': [1, 2, 3, 4, 5]})

In [121]:
df['Values'].mean()

3.0

In [122]:
df['Values'].median()

3.0

In [123]:
df['Values'].std()

1.5811388300841898

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [124]:
df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100], 'Date': pd.date_range(start='2022-01-01', periods=10)})

In [125]:
df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

In [126]:
df

   Sales       Date  MovingAverage
0     10 2022-01-01           10.0
1     20 2022-01-02           15.0
2     30 2022-01-03           20.0
3     40 2022-01-04           25.0
4     50 2022-01-05           30.0
5     60 2022-01-06           35.0
6     70 2022-01-07           40.0
7     80 2022-01-08           50.0
8     90 2022-01-09           60.0
9    100 2022-01-10           70.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [127]:
df = pd.DataFrame({'Date': pd.date_range(start='2023-01-01', periods=5)})

In [128]:
df['Weekday'] = df['Date'].dt.day_name()

In [129]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [130]:
pd = pd.DataFrame({'Date': pd.date_range(start='2023-01-01', end='2023-02-28', freq='D')})

In [131]:
pd[0:31]

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13

In [132]:
import pandas as pd